# Loan Prediction Project

The goal of this project is predict the eligibility of a customer to recive a loan.

In [15]:
# lbis to be used

import pandas as pd

In [104]:
file_path = "C:\\Users\\ajoor\\Desktop\\Projects\LoanPrediction\\Data\\"


file_name1 = "loan_train.csv"
file_name2 = "loan_test.csv"

In [105]:
df1 = pd.read_csv(file_path+file_name1)
df2 = pd.read_csv(file_path+file_name2)

In [106]:
df1.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [107]:
# Inspecting the first dataframe
print('Shape:', df1.shape)
print ("----------------------------------")
print('Columns:', df1.columns)
print ("----------------------------------")
print ("Gender: ",df1['Gender'].unique())
print ("----------------------------------")
print ("Married: ",df1['Married'].unique())
print ("----------------------------------")
print ("Dependents: ",df1['Dependents'].unique())
print ("----------------------------------")
print ("Education: ",df1['Education'].unique())
print ("----------------------------------")
print ("Self_Employed: ",df1['Self_Employed'].unique())
print ("----------------------------------")
print ("Credit_History: ",df1['Credit_History'].unique())
print ("----------------------------------")
print ("Property_Area: ",df1['Property_Area'].unique())
print ("----------------------------------")
print ("Loan_Status: ",df1['Loan_Status'].unique())
print ("----------------------------------")
print ('     ','n')
print (df1['Loan_Status'].value_counts())
print ("----------------------------------")
print (df1.dtypes)

Shape: (614, 13)
----------------------------------
Columns: Index(['Loan_ID', 'Gender', 'Married', 'Dependents', 'Education',
       'Self_Employed', 'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'Loan_Status'],
      dtype='object')
----------------------------------
Gender:  ['Male' 'Female' nan]
----------------------------------
Married:  ['No' 'Yes' nan]
----------------------------------
Dependents:  ['0' '1' '2' '3+' nan]
----------------------------------
Education:  ['Graduate' 'Not Graduate']
----------------------------------
Self_Employed:  ['No' 'Yes' nan]
----------------------------------
Credit_History:  [ 1.  0. nan]
----------------------------------
Property_Area:  ['Urban' 'Rural' 'Semiurban']
----------------------------------
Loan_Status:  ['Y' 'N']
----------------------------------
      n
Y    422
N    192
Name: Loan_Status, dtype: int64
----------------------------------
Loan_ID               object
Gender                object
Married               object
Dependents            object
Education             object
Self_Employed         object
ApplicantIncome        int64
CoapplicantIncome    float64
LoanAmount           float64
Loan_Amount_Term     float64
Credit_History       float64
Property_Area         object
Loan_Status           object
dtype: object

 - Gender, Married, Education, Property_Area, Self_Employed, & Loan_Status should be converted to categorical values.
 - Credit_History, & Dependents categorical ?

In [108]:
df2.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
0,LP001015,Male,Yes,0,Graduate,No,5720,0,110.0,360.0,1.0,Urban
1,LP001022,Male,Yes,1,Graduate,No,3076,1500,126.0,360.0,1.0,Urban
2,LP001031,Male,Yes,2,Graduate,No,5000,1800,208.0,360.0,1.0,Urban
3,LP001035,Male,Yes,2,Graduate,No,2340,2546,100.0,360.0,NaN,Urban
4,LP001051,Male,No,0,Not Graduate,No,3276,0,78.0,360.0,1.0,Urban

- The column loan status does **NOT** exist in df2, and therefore, it will be predicited
- We can combine both dataframes to prepare the data

In [109]:
df1_copy = df1.copy()

In [110]:
df1_copy.head(2)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N

In [111]:
y=df1_copy[["Loan_ID","Loan_Status"]]
df1_copy.drop("Loan_Status", axis=1, inplace= True)

In [112]:
df = pd.concat([df1_copy,df2])   # It is important that the order stays the same

In [113]:
df.shape

(981, 12)

## Dealing with catgorical NaN values

In [114]:
def NanReplacer(column,value):
    df[[column]] = df[[column]].fillna(value=value)
    print(df[column].value_counts())

In [115]:
NanReplacer(column='Gender',value= "Un-specified")

Male            775
Female          182
Un-specified     24
Name: Gender, dtype: int64

In [116]:
NanReplacer(column='Married',value= "UnKnown")

Yes        631
No         347
UnKnown      3
Name: Married, dtype: int64

In [117]:
NanReplacer(column='Dependents',value= "UnKnown")

0          545
1          160
2          160
3+          91
UnKnown     25
Name: Dependents, dtype: int64

In [118]:
NanReplacer(column='Self_Employed',value= "UnKnown")

No         807
Yes        119
UnKnown     55
Name: Self_Employed, dtype: int64

In [119]:
NanReplacer(column='Credit_History',value= "UnKnown")

1.0        754
0.0        148
UnKnown     79
Name: Credit_History, dtype: int64

In [120]:
df[["Gender"]] = df[["Gender"]].astype('category')
df[["Married"]] = df[["Married"]].astype('category')
df[["Dependents"]] = df[["Dependents"]].astype('category')
df[["Education"]] = df[["Education"]].astype('category')
df[["Self_Employed"]] = df[["Self_Employed"]].astype('category')
df[["Credit_History"]] = df[["Credit_History"]].astype('category')
df[["Property_Area"]] = df[["Property_Area"]].astype('category')

In [121]:
df.dtypes

Loan_ID                object
Gender               category
Married              category
Dependents           category
Education            category
Self_Employed        category
ApplicantIncome         int64
CoapplicantIncome     float64
LoanAmount            float64
Loan_Amount_Term      float64
Credit_History       category
Property_Area        category
dtype: object

## Dealing with Numeric NaN values

In [122]:
print ('                       ','n')
print("ApplicantIncome:       ",df["ApplicantIncome"].isna().sum())
print("CoapplicantIncome:     ",df["CoapplicantIncome"].isna().sum())
print("LoanAmount:            ",df["LoanAmount"].isna().sum())
print("Loan_Amount_Term:      ",df["Loan_Amount_Term"].isna().sum())

                        n
ApplicantIncome:        0
CoapplicantIncome:      0
LoanAmount:             27
Loan_Amount_Term:       20

In [123]:
df.describe()

       ApplicantIncome  CoapplicantIncome  LoanAmount  Loan_Amount_Term
count       981.000000         981.000000  954.000000        961.000000
mean       5179.795107        1601.916330  142.511530        342.201873
std        5695.104533        2718.772806   77.421743         65.100602
min           0.000000           0.000000    9.000000          6.000000
25%        2875.000000           0.000000  100.000000        360.000000
50%        3800.000000        1110.000000  126.000000        360.000000
75%        5516.000000        2365.000000  162.000000        360.000000
max       81000.000000       41667.000000  700.000000        480.000000

In [124]:
df[["LoanAmount"]] = df[["LoanAmount"]].fillna(value=df.LoanAmount.median()) # replace NaNs with median value
df[["Loan_Amount_Term"]] = df[["Loan_Amount_Term"]].fillna(value=df.Loan_Amount_Term.mode()) # replace with mode value

In [125]:
df.describe()

       ApplicantIncome  CoapplicantIncome  LoanAmount  Loan_Amount_Term
count       981.000000         981.000000  981.000000        961.000000
mean       5179.795107        1601.916330  142.057085        342.201873
std        5695.104533        2718.772806   76.395592         65.100602
min           0.000000           0.000000    9.000000          6.000000
25%        2875.000000           0.000000  101.000000        360.000000
50%        3800.000000        1110.000000  126.000000        360.000000
75%        5516.000000        2365.000000  160.000000        360.000000
max       81000.000000       41667.000000  700.000000        480.000000

## Spliting Back data:

In [140]:
train = pd.merge(df,y, how='inner')
test = df[len(y):len(df)]

In [143]:
train.to_csv(file_path+"df.csv") # Exported to be analyzed with R

## R Summary:

## Machine Learning: